Repository: big-boss1004/project-system
Catalog: src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/Dependencies/xlf/PackageReference.xaml.*.xlf
Languages: cs, tr

# Rule|PackageReference|DisplayName
source: Package Reference
cs: Balíček
tr: Paket

# Rule|PackageReference|Description
source: Package Reference Properties
cs: Vlastnosti balíčku
tr: Paket Özellikleri

# StringProperty|Version|DisplayName
source: Version
cs: Verze
tr: Sürüm

# StringProperty|Version|Description
source: Version of dependency.
cs: Verze závislosti
tr: Bağımlılık sürümü.

# StringProperty|IncludeAssets|DisplayName
source: Included Assets
cs: Zahrnuté prostředky
tr: Dahil edilen varlıklar

# StringProperty|IncludeAssets|Description
source: Assets to include from this reference.
cs: Prostředky zahrnuté z tohoto odkazu
tr: Bu başvurudan eklenecek varlıklar.

# StringProperty|ExcludeAssets|DisplayName
source: Excluded Assets
cs: Vyloučené prostředky
tr: Hariç tutulan varlıklar

# StringProperty|ExcludeAssets|Description
source: Assets to exclude from this reference.
cs: Prostředky vyloučené z tohoto odkazu
tr: Bu başvuruya dahil edilmeyecek varlıklar.

# StringProperty|PrivateAssets|DisplayName
source: Private Assets
cs: Privátní prostředky
tr: Özel varlıklar

# StringProperty|PrivateAssets|Description
source: Assets that are private in this reference.
cs: Prostředky, které jsou v tomto odkazu soukromé
tr: Bu başvuruda özel olan varlıklar.

# StringProperty|NoWarn|DisplayName
source: Suppress Warnings
cs: Potlačit upozornění
tr: Uyarıları Gizle

# StringProperty|NoWarn|Description
source: Comma-delimited list of warnings that should be suppressed for this package.
cs: Seznam upozornění oddělených čárkou, která by se měla pro tento balíček potlačit
tr: Bu paket için gizlenmesi gereken virgülle ayrılmış uyarı listesi.

# BoolProperty|GeneratePathProperty|DisplayName
source: Generate Path Property
cs: Generovat vlastnost cesty
tr: Yol özelliği oluştur

# BoolProperty|GeneratePathProperty|Description
source: Indicates whether to generate an MSBuild property with the location of the package's root directory. The generated property name is in the form of 'Pkg[PackageID]', where '[PackageID]' is the ID of the package with any periods '.' replaced with underscores '_'.
cs: Určuje, jestli se má generovat vlastnost MSBuildu s umístěním kořenového adresáře balíčku. Název generované vlastnosti je ve formátu Pkg[ID_balíčku], kde [ID_balíčku] je ID balíčku, ve kterém jsou tečky nahrazené podtržítky.
tr: Paket kök dizini konumuyla bir MSBuild özelliği oluşturulup oluşturulmayacağını belirtir. Oluşturulan özellik adı 'Pkg[PackageID]' biçimindedir. Burada '[PackageID]', noktalar '.' alt çizgi '_' ile değiştirilmiş olarak paketin adıdır.
