Repository: big-boss1004/project-system
Catalog: src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/xlf/ConfigurationGeneral.xaml.*.xlf
Languages: cs, es, it, pt_br, ru, tr, zh_hans

# Rule|ConfigurationGeneral|DisplayName
source: General
cs: Obecné
it: Generale
pt_br: Geral
ru: Общие
tr: Genel
zh_hans: 常规

# Rule|ConfigurationGeneral|Description
source: General
cs: Obecné
it: Generale
pt_br: Geral
ru: Общие
tr: Genel
zh_hans: 常规

# Category|General|DisplayName
source: General
cs: Obecné
it: Generale
pt_br: Geral
ru: Общие
tr: Genel
zh_hans: 常规

# Category|General|Description
source: General
cs: Obecné
it: Generale
pt_br: Geral
ru: Общие
tr: Genel
zh_hans: 常规

# StringProperty|ApplicationIcon|DisplayName
source: Application Icon
cs: Ikona aplikace
es: Icono de aplicación
it: Icona dell'applicazione
pt_br: Ícone do Aplicativo
ru: Значок приложения
tr: Uygulama Simgesi
zh_hans: 应用程序图标

# StringProperty|TargetFrameworkIdentifier|DisplayName
source: Target Framework Identifier
cs: Identifikátor cílové platformy
es: Identificador de la plataforma de destino
it: Identificatore framework di destinazione
pt_br: Identificador de Estrutura de Destino
ru: Идентификатор целевой платформы
tr: Hedef Çerçeve Tanımlayıcısı
zh_hans: 目标框架标识符

# StringProperty|TargetFrameworks|DisplayName
source: Target Frameworks
cs: Cílové platformy
es: Plataformas de destino
it: Framework di destinazione
pt_br: Estruturas de Destino
ru: Целевые платформы
tr: Hedef Çerçeveler
zh_hans: 目标框架

# StringProperty|TargetFramework|DisplayName
source: Target Framework
cs: Cílová platforma
es: Plataforma de destino
it: Framework di destinazione
pt_br: Estrutura de Destino
ru: Целевая платформа
tr: Hedef Çerçeve
zh_hans: 目标框架

# StringProperty|TargetFrameworkProfile|DisplayName
source: Target Framework Profile
cs: Profil cílové platformy
es: Perfil de la plataforma de destino
it: Profilo framework di destinazione
pt_br: Perfil da Estrutura de Destino
ru: Профиль целевой платформы
tr: Hedef Çerçeve Profili
zh_hans: 目标框架配置文件

# StringProperty|TargetFrameworkVersion|DisplayName
source: Target Framework Version
cs: Verze cílové platformy
es: Versión de la plataforma de destino
it: Versione framework di destinazione
pt_br: Versão da Estrutura de Destino
ru: Версия целевой платформы
tr: Hedef Çerçeve Sürümü
zh_hans: 目标框架版本

# StringProperty|TargetFrameworkMoniker|DisplayName
source: Target Framework Moniker
cs: Moniker cílového rozhraní
es: Moniker de la plataforma de destino
it: Moniker framework di destinazione
pt_br: Moniker de Estrutura de Destino
ru: Моникер целевой платформы
tr: Hedef Çerçeve Adı
zh_hans: 目标框架名字对象

# StringProperty|DocumentationFile|DisplayName
source: XML doc comments file
cs: Soubor komentářů dokumentu XML
es: Archivo de comentarios de documento XML
it: File dei commenti in formato documentazione XML
pt_br: Arquivo de comentários do doc XML
ru: Файл комментариев XML-документа
tr: XML belgesi açıklamalar dosyası
zh_hans: XML 文档注释文件

# StringProperty|RootNamespace|DisplayName
source: Root namespace
cs: Kořenový obor názvů
es: Espacio de nombres de la raíz
it: Spazio dei nomi radice
pt_br: Namespace raiz
ru: Корневое пространство имен
tr: Kök ad alanı
zh_hans: 根命名空间

# EnumValue|OutputType.Library|DisplayName
source: Class Library
cs: Knihovna tříd
es: Biblioteca de clases
it: Libreria di classi
pt_br: Biblioteca de Classes
ru: Библиотека классов
tr: Sınıf Kitaplığı
zh_hans: 类库

# EnumValue|OutputType.AppContainerExe|DisplayName
source: Windows Store app
cs: Aplikace pro Windows Store
es: Aplicación de la Tienda Windows
it: App di Windows Store
pt_br: Aplicativo da Windows Store
ru: Приложение Магазина Windows
tr: Windows Mağazası Uygulaması
zh_hans: Windows 应用商店应用

# BoolProperty|Optimize|Description
source: Should compiler optimize output?
cs: Má kompilátor optimalizovat výstup?
es: ¿Debe el compilador optimizar los resultados?
it: Indicare se il compilatore deve ottimizzare l'output.
pt_br: O compilador deve otimizar o resultado?
ru: Должен ли компилятор оптимизировать выходные файлы?
tr: Derleyici çıkışı en iyi duruma getirmeli midir?
zh_hans: 编译器是否应优化输出?

# StringProperty|PackageAction|Description
source: The MSBuild target to use when packaging a project.
cs: Cíl nástroje MSBuild, který se má použít při vytváření balíčku projektu
es: Versión de destino de MSBuild que se usará al empaquetar un proyecto.
it: Destinazione MSBuild da usare quando si crea il pacchetto di un progetto.
pt_br: O destino do MSBuild a ser usado no empacotemento de um projeto.
ru: Целевой объект MSBuild, используемый при упаковке проекта.
tr: Bir proje paketlenirken kullanılacak MSBuild hedefi.
zh_hans: 将项目打包时使用的 MSBuild 目标。

# StringProperty|DefaultContentType|Description
source: The default content type name to use when adding files.
cs: Výchozí název typu obsahu, který se má použít při přidávání souborů
es: Nombre del tipo de contenido predeterminado que se usará al agregar archivos.
it: Nome del tipo di contenuto predefinito da usare quando si aggiungono file.
pt_br: O nome do tipo de conteúdo padrão a ser usado ao adicionar arquivos.
ru: Имя типа содержимого по умолчанию, используемое при добавлении файлов.
tr: Dosya eklenirken kullanılacak varsayılan içerik türü adı.
zh_hans: 添加文件时使用的默认内容类型名称。

# EnumValue|TargetRuntime.AppHost|DisplayName
source: Windows app
cs: Aplikace pro Windows
es: Aplicación de Windows
it: App di Windows
pt_br: Aplicativo do Windows
ru: Приложение Windows
tr: Windows uygulaması
zh_hans: Windows 应用

# BoolProperty|SuppressOutOfDateMessageOnBuild|Description
source: True to just build out-of-date projects without ever prompting the user to confirm.
cs: Hodnota True, pokud se mají sestavit zastaralé projekty, aniž by se uživateli vůbec zobrazila výzva k potvrzení
es: True para compilar simplemente proyectos no actualizados sin pedir confirmación al usuario.
it: True per compilare solo progetti non aggiornati senza richiedere conferma all'utente.
pt_br: True para compilar apenas projetos desatualizados sem solicitar a confirmação do usuário.
ru: Значение true, чтобы просто выполнить сборку устаревших проектов, не запрашивая у пользователя подтверждение.
tr: Yalnızca kullanıcının onayı istenmeden güncel olmayan projeleri oluşturmak için true.
zh_hans: 如果设置为 True，则直接生成过时的项目，而从不提示用户进行确认。

# StringProperty|SharedProjectAppliesTo|Description
source: Capability match expression that at a minimum tests for the language of the Shared Project; used to filter Add Shared Project Reference choices.
cs: Výraz pro porovnání schopností, který přinejmenším testuje jazyk sdíleného projektu. Používá se k filtrování možností pro přidání odkazu na sdílený projekt.
es: Expresión de coincidencia de funcionalidad que como mínimo prueba el idioma del proyecto compartido; se usa para filtrar selecciones de Agregar referencia de proyecto compartido.
it: Espressione di confronto delle funzionalità che verifica almeno la lingua del progetto condiviso; viene usata per filtrare le opzioni per l'aggiunta di riferimenti al progetto condiviso.
pt_br: Expressão de correspondência de capacidade que, no mínimo, testa o idioma do Projeto Compartilhado; usado para filtrar opções de Adicionar Referência de Projeto Compartilhado.
ru: Выражение сопоставления возможностей, которое по минимуму тестирует язык общедоступного проекта; используется для фильтрации выбранных элементов "Добавление ссылок общедоступного проекта".
tr: Paylaşılan Proje'nin en azından dilini test etmeye yönelik yetenek eşleştirme ifadesi; Paylaşılan Proje Başvurusu Ekle seçimlerini filtrelemek için kullanılır.
zh_hans: 至少会对共享项目的语言进行测试的功能匹配表达式；用于筛选“添加共享项目引用”选项。

# BoolProperty|AlwaysUseNumericalSuffixInItemNames|Description
source: Indicates if names of newly added items should always be suffixed with a number.
cs: Určuje, jestli se mají za názvy nově přidaných položek vždycky připojovat čísla.
es: Indica si los nombres de los nuevos elementos agregados debe incluir un sufijo con un número.
it: Indica se ai nomi dei nuovi elementi aggiunti è sempre necessario aggiungere un suffisso numerico.
pt_br: Indica se os nomes dos itens recém-adicionados devem sempre ser sufixados com um número.
ru: Указывает, должны ли имена новых добавленных элементов заканчиваться суффиксом в виде числа.
tr: Yeni eklenen öğelerin adlarına her zaman son ek olarak sayı eklenmesi gerekip gerekmediğini gösterir.
zh_hans: 指示新添加的项目名称是否应该始终使用数字作后缀。

# StringProperty|LanguageServiceName|Description
source: Represents the LanguageName that is passed to Roslyn
cs: Představuje hodnotu LanguageName předávanou kompilátoru Roslyn
es: Representa el elemento LanguageName que se pasa a Roslyn
it: Rappresenta l'elemento LanguageName passato a Roslyn
pt_br: Representa o LanguageName passado para a Roslyn
ru: Представляет атрибут LanguageName, передаваемый в Roslyn
tr: Roslyn’e geçirilen LanguageName öğesini temsil eder
zh_hans: 表示传递给 Roslyn 的 LanguageName

# StringProperty|TemplateLanguage|Description
source: Represent the language that is persisted in items and project templates
cs: Představuje jazyk, který přetrvává v položkách a šablonách projektu
es: Representa el lenguaje que se mantiene en los elementos y las plantillas de proyecto
it: Rappresenta il linguaggio impostato come permanente in elementi e modelli di progetto
pt_br: Representa o idioma persistido em modelos de projeto e itens
ru: Представляет язык, который сохраняется в элементах и шаблонах проектов
tr: Öğelerde ve proje şablonlarında kalıcı olan dili temsil eder
zh_hans: 表示项和项目模板中保留的语言

# EnumValue|OutputType.Exe|DisplayName
source: Console Application
cs: Konzolová aplikace
it: Applicazione console
ru: Консольное приложение
tr: Konsol Uygulaması

# EnumValue|OutputType.WinExe|DisplayName
source: Windows Application
cs: Aplikace pro systém Windows
it: Applicazione Windows
ru: Приложение Windows
tr: Windows Uygulaması

# StringProperty|LanguageServiceId|Description
source: Represents the GUID of object that implements the language service for the project.
cs: Představuje identifikátor GUID objektu, který implementuje službu jazyka pro tento projekt.
it: Rappresenta il GUID dell'oggetto che implementa il servizio di linguaggio per il progetto.
ru: Представляет GUID объекта, который реализует языковую службу для проекта.
tr: Proje için dil hizmetini uygulayan nesnenin GUID’ini temsil eder.

# StringProperty|TargetFrameworkMonikers|DisplayName
source: Target Framework Monikers
cs: Monikery cílové architektury
it: Moniker framework di destinazione
ru: Моникеры целевой платформы
tr: Hedef Çerçeve Bilinen Adları

# BoolProperty|DisableFastUpToDateCheck|DisplayName
source: Disable Fast Up To Date Check
it: Disabilita controllo aggiornamenti rapido
ru: Отключить быструю проверку на актуальность

# StringProperty|NETCoreSdkVersion|Description
source: Represents the version of the dotnet sdk being used (if any).
ru: Представляет используемую версию пакета SDK для .NET (если есть).

# EnumValue|OutputType.exe|DisplayName
source: Console Application
es: Aplicación de consola

# EnumValue|OutputType.winexe|DisplayName
source: Windows Application
es: Aplicación Windows
