Repository: big-boss1004/project-system
Catalog: src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/xlf/DebuggerGeneral.xaml.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, zh_hans, zh_hant

# Rule|DebuggerGeneralProperties|DisplayName
source: Debugger General Properties
cs: Obecné vlastnosti ladicího programu
de: Allgemeine Debuggereigenschaften
fr: Propriétés générales du débogueur
it: Proprietà generali del debugger
ja: デバッガーの全般プロパティ
ko: 디버거 일반 속성
pl: Właściwości ogólne debugera
pt_br: Propriedades Gerais do Depurador
ru: Общие свойства отладчика
zh_hans: 调试器常规属性
zh_hant: 偵錯工具一般屬性

# Rule|DebuggerGeneralProperties|Description
source: General Debugger options
cs: Obecné možnosti ladicího programu
de: Allgemeine Debuggeroptionen
fr: Options générales du débogueur
it: Opzioni generali del debugger
ja: デバッガーの全般オプション
ko: 일반 디버거 옵션
pl: Opcje ogólne debugera
pt_br: Opções Gerais do Depurador
ru: Общие параметры отладчика
zh_hans: 常规调试器选项
zh_hant: 一般偵錯工具選項

# StringProperty|SymbolsPath|DisplayName
source: Symbol Search Path
cs: Cesta pro hledání symbolů
de: Symbolsuchpfad
fr: Chemin de recherche des symboles
it: Percorso di ricerca dei simboli
ja: シンボルの検索パス
ko: 기호 검색 경로
pl: Ścieżka wyszukiwania symbolu
pt_br: Caminho de pesquisa de símbolos
ru: Путь поиска символов
zh_hans: 符号搜索路径
zh_hant: 符號搜尋路徑

# StringProperty|SymbolsPath|Description
source: The search path used by the debugger to locate symbols.
cs: Vyhledávací cesta, kterou ladicí program používá pro vyhledávání symbolů
de: Der vom Debugger zum Suchen nach Symbolen verwendete Suchpfad.
fr: Chemin de recherche utilisé par le débogueur pour trouver les symboles.
it: Percorso di ricerca usato dal debugger per individuare i simboli.
ja: シンボルを見つけるためにデバッガーが使用する検索パスです。
ko: 디버거가 기호를 찾기 위해 사용하는 검색 경로입니다.
pl: Ścieżka wyszukiwania używana przez debuger do lokalizowania symboli.
pt_br: O caminho de pesquisa usado pelo depurador para localizar os símbolos.
ru: Путь поиска используется отладчиком для поиска символов.
zh_hans: 调试器用来定位符号的搜索路径。
zh_hant: 偵錯工具用來尋找符號的搜尋路徑。

# StringProperty|DebuggerFlavor|Description
source: The debug rule selected as the active debugger.
cs: Pravidlo ladění zvolené jako aktivní ladicí program
de: Die als aktiver Debugger ausgewählte Debugregel.
fr: Règle de débogage sélectionnée en tant que débogueur actif.
it: Regola di debug specificata come debugger attivo.
ja: アクティブなデバッガーとして選択されるデバッグ規則です。
ko: 활성 디버거로 선택된 디버그 규칙입니다.
pl: Reguła debugowania wybrana jako aktywny debuger.
pt_br: A regra de depuração selecionada como o depurador ativo.
ru: Правило отладки выбрано как активный отладчик.
zh_hans: 选定为活动调试器的调试规则。
zh_hant: 被選為現用偵錯工具的偵錯規則。

# EnumProperty|ImageClrType|Description
source: The 'hidden' property we pass to debuggers to let them know if this is a managed project.
cs: Skrytá vlastnost předávaná ladicím programům, podle níž poznají, zda se jedná o spravovaný projekt.
de: Die "ausgeblendete" Eigenschaft, die an Debugger weitergegeben wird, um ihnen mitzuteilen, ob es sich um ein verwaltetes Projekt handelt.
fr: Propriété 'hidden' passée aux débogueurs pour leur indiquer s'il s'agit d'un projet managé.
it: La proprietà 'hidden' viene passata ai debugger per indicare se il progetto è gestito.
ja: プロジェクトがマネージ プロジェクトであるかどうかを示すためにデバッガーに渡す 'hidden' プロパティです。
ko: 관리되는 프로젝트인지 알 수 있도록 디버거로 전달되는 '숨김' 속성입니다.
pl: Właściwość „ukryty” przekazujemy do debugera, aby poinformować go, czy jest to zarządzany projekt.
pt_br: A propriedade 'oculta' que passamos aos depuradores para que eles saibam se este é um projeto gerenciado.
ru: "Скрытое" свойство, передаваемое нами отладчикам, чтобы они знали, является ли проект управляемым.
zh_hans: 传递给调试器的“hidden”属性，以便让调试器知道此项目是否为托管项目。
zh_hant: 我們傳遞至偵錯工具的 'hidden' 屬性，讓偵錯工具知道這是否為 Managed 專案。

# EnumValue|ImageClrType.Native|DisplayName
source: Native Image
cs: Nativní bitová kopie
de: Natives Image
fr: Image native
it: Immagine nativa
ja: ネイティブ イメージ
ko: 네이티브 이미지
pl: Obraz natywny
pt_br: Imagem nativa
ru: Машинный образ
zh_hans: 本机映像
zh_hant: 原生映像

# EnumValue|ImageClrType.Native|Description
source: The executable image to debug is a fully native application.
cs: Spustitelná bitová kopie, která se má ladit, je aplikace tvořená výhradně nativním kódem.
de: Das zu debuggende ausführbare Image ist eine vollständig native Anwendung.
fr: L'image exécutable utilisée pour le débogage est une application entièrement native.
it: L'immagine eseguibile di cui eseguire il debug è un'applicazione completamente nativa.
ja: デバッグ対象の実行可能イメージは、完全なネイティブ アプリケーションです。
ko: 디버깅할 실행 가능 이미지가 완전한 네이티브 응용 프로그램입니다.
pl: Wykonywalny obraz do debugowania jest w pełni natywną aplikacją.
pt_br: A imagem executável para depurar é um aplicativo totalmente nativo.
ru: Исполняемый образ для отладки является полностью родным приложением.
zh_hans: 要调试的可执行文件映像是完全的本机应用程序。
zh_hant: 要偵錯的可執行映像完全是一個原生應用程式。

# EnumValue|ImageClrType.Mixed|DisplayName
source: Mixed Image
cs: Smíšená bitová kopie
de: Gemischtes Image
fr: Image mixte
it: Immagine mista
ja: 混合イメージ
ko: 혼합 이미지
pl: Obraz mieszany
pt_br: Imagem mista
ru: Смешанный образ
zh_hans: 混合映像
zh_hant: 混合映像

# EnumValue|ImageClrType.Mixed|Description
source: The executable image to debug is a mixture of native and managed code.
cs: Spustitelná bitová kopie, která se má ladit, je kombinací nativního a spravovaného kódu.
de: Das zu debuggende ausführbare Image ist eine Mischung aus nativem und verwaltetem Code.
fr: L'image exécutable utilisée pour le débogage est une combinaison de code natif et managé.
it: L'immagine eseguibile di cui eseguire il debug è una combinazione di codice nativo e codice gestito.
ja: デバッグ対象の実行可能イメージは、ネイティブ コードとマネージ コードの混合です。
ko: 디버깅할 실행 가능 이미지가 네이티브 코드와 관리 코드가 혼합된 이미지입니다.
pl: Wykonywalny obraz do debugowania jest mieszaniną kodu natywnego i zarządzanego.
pt_br: A imagem executável para depurar é uma mistura de código nativo e gerenciado.
ru: Исполняемый образ для отладки - это смесь машинного и управляемого кода.
zh_hans: 要调试的可执行文件映像是本机代码和托管代码的混合。
zh_hant: 要偵錯的可執行映像是機器碼與 Managed 程式碼的混合物。

# EnumValue|ImageClrType.Managed|DisplayName
source: Managed Image
cs: Spravovaná bitová kopie
de: Verwaltetes Image
fr: Image managée
it: Immagine gestita
ja: マネージ イメージ
ko: 관리되는 이미지
pl: Zarządzany obraz
pt_br: Imagem gerenciada
ru: Управляемый образ
zh_hans: 托管映像
zh_hant: Managed 映像

# EnumValue|ImageClrType.Managed|Description
source: The executable image to debug is a fully managed application.
cs: Spustitelná bitová kopie, která se má ladit, je aplikace tvořená výhradně spravovaným kódem.
de: Das zu debuggende ausführbare Image ist eine vollständige verwaltete Anwendung.
fr: L'image exécutable utilisée pour le débogage est une application entièrement managée.
it: L'immagine eseguibile di cui eseguire il debug è un'applicazione completamente gestita.
ja: デバッグ対象の実行可能イメージは、完全なマネージ アプリケーションです。
ko: 디버깅할 실행 가능 이미지가 완전히 관리되는 응용 프로그램입니다.
pl: Wykonywalny obraz do debugowania jest w pełni zarządzaną aplikacją.
pt_br: A imagem executável para depurar é um aplicativo totalmente gerenciado.
ru: Исполняемый образ для отладки является полностью управляемым приложением.
zh_hans: 要调试的可执行文件映像是完全的托管应用程序。
zh_hant: 要偵錯的可執行映像完全是一個 Managed 應用程式。
