Repository: big-boss1004/project-system
Catalog: src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/xlf/ResolvedCOMReference.xaml.*.xlf
Languages: fr

# Rule|ResolvedCOMReference|DisplayName
source: Resolved COM Reference
fr: Référence COM résolue

# Rule|ResolvedCOMReference|Description
source: COM Reference Properties
fr: Référence résolue

# StringProperty|Guid|Description
source: The GUID of the COM server.
fr: GUID du serveur COM.

# StringListProperty|Aliases|DisplayName
source: Aliases
fr: Alias

# StringListProperty|Aliases|Description
source: A comma-delimited list of aliases to this reference.
fr: Liste d'alias à cette référence délimités par des virgules.

# BoolProperty|CopyLocal|DisplayName
source: Copy Local
fr: Copie locale

# BoolProperty|CopyLocal|Description
source: Indicates whether the reference will be copied to the output directory.
fr: Indique si la référence sera copiée dans le répertoire de sortie.

# StringProperty|Culture|Description
source: The value of the culture field from the assembly metadata.
fr: Valeur du champ Culture des métadonnées de l'assembly.

# StringProperty|Description|Description
source: The value of the Title field from the assembly metadata.
fr: Valeur du champ Title des métadonnées de l'assembly.

# BoolProperty|EmbedInteropTypes|DisplayName
source: Embed Interop Types
fr: Incorporer les types d'interopérabilité

# BoolProperty|EmbedInteropTypes|Description
source: Indicates whether types defined in this assembly will be embedded into the target assembly.
fr: Indique si les types définis dans cet assembly seront incorporés dans l'assembly cible.

# EnumProperty|FileType|DisplayName
source: File Type
fr: Type de fichier

# EnumProperty|FileType|Description
source: The file type of the reference.
fr: Type de fichier de la référence.

# EnumValue|FileType.Assembly|DisplayName
source: .NET assembly
fr: Assembly .NET

# EnumValue|FileType.ActiveX|DisplayName
source: COM type library
fr: Bibliothèque de types COM

# EnumValue|FileType.Native Assembly|DisplayName
source: Native Assembly
fr: Assembly natif

# StringProperty|Identity|DisplayName
source: Identity
fr: Identité

# StringProperty|Identity|Description
source: Security identity of the referenced assembly (see System.Reflection.Assembly.Evidence or System.Security.Policy.Evidence).
fr: Identité de sécurité de l'assembly référencé (consultez System.Reflection.Assembly.Evidence ou System.Security.Policy.Evidence).

# StringProperty|ResolvedPath|DisplayName
source: Path
fr: Chemin d'accès

# StringProperty|ResolvedPath|Description
source: Location of the file being referenced.
fr: Emplacement du fichier référencé.

# StringProperty|RuntimeVersion|DisplayName
source: Runtime Version
fr: Version du runtime

# StringProperty|RuntimeVersion|Description
source: Version of the .NET runtime this assembly was compiled against.
fr: Version du runtime .NET avec lequel cet assembly a été compilé.

# BoolProperty|SpecificVersion|DisplayName
source: Specific Version
fr: Version spécifique

# BoolProperty|SpecificVersion|Description
source: Indicates whether this assembly can be resolved without regard to multi-targeting rules for assembly resolution.
fr: Indique si cet assembly peut être résolu sans tenir compte des règles de multiciblage pour la résolution de l'assembly.

# BoolProperty|StrongName|DisplayName
source: Strong Name
fr: Nom fort

# BoolProperty|StrongName|Description
source: True indicates that the reference has been signed with a key-pair.
fr: True indique que la référence a été signée avec une paire de clés.

# StringProperty|Version|Description
source: Version of reference.
fr: Version de référence.

# StringProperty|RequiredTargetFramework|DisplayName
source: Required Target Framework
fr: Framework cible requis

# BoolProperty|IsWinMDFile|Description
source: Indicates whether the project system ascertained that this is a WinMD (as opposed to an assembly)
fr: Indique si le système de projet a établi qu'il s'agit d'un WinMD (et non d'un assembly)

# BoolProperty|WinMDFile|Description
source: Indicates whether the build system ascertained that this is a WinMD (as opposed to an assembly)
fr: Indique si le système de génération a établi qu'il s'agit d'un WinMD (et non d'un assembly)

# StringProperty|OriginalItemSpec|Description
source: The evaluated item name of the original reference item whose resolution resulted in this resolved reference item.
fr: Nom d'élément évalué de l'élément de référence d'origine dont la résolution a eu pour résultat cet élément de référence résolu.
