Repository: big-boss1004/project-system
Catalog: src/Microsoft.VisualStudio.ProjectSystem.Managed/ProjectSystem/Rules/xlf/ResolvedProjectReference.xaml.*.xlf
Languages: cs, de, es, pl, ru, zh_hans, zh_hant

# Rule|ResolvedProjectReference|DisplayName
source: Resolved Project Reference
cs: Vyřešené odkazy projektu
de: Aufgelöster Projektverweis
es: Referencia de proyecto resuelta
pl: Rozpoznane odwołanie do projektu
ru: Разрешенная ссылка проекта
zh_hans: 解析的项目引用
zh_hant: 已解析的專案參考

# Rule|ResolvedProjectReference|Description
source: Reference Properties
cs: Vlastnosti odkazu
de: Verweiseigenschaften
es: Propiedades de la referencia
pl: Właściwości odwołania
ru: Свойства ссылки
zh_hans: 引用属性
zh_hant: 已解析的參考

# StringListProperty|Aliases|DisplayName
source: Aliases
cs: Aliasy
de: Aliase
es: Alias
pl: Aliasy
ru: Псевдонимы
zh_hans: 别名
zh_hant: 別名

# StringListProperty|Aliases|Description
source: A comma-delimited list of aliases to this reference.
cs: Seznam aliasů tohoto odkazu oddělených čárkou
de: Eine durch Komma getrennte Liste von Aliasen zu diesem Verweis.
es: Lista de alias delimitada con comas para esta referencia.
pl: Rozdzielona przecinkami lista aliasów do tego odwołania.
ru: Разделенный запятыми список псевдонимов данной сборки.
zh_hans: 此引用的别名的逗号分隔列表。
zh_hant: 這個參考的逗號分隔別名清單。

# BoolProperty|CopyLocal|DisplayName
source: Copy Local
cs: Kopírovat místně
de: Lokale Kopie
es: Copia local
pl: Kopia lokalna
ru: Копировать локально
zh_hans: 复制本地
zh_hant: 複製到本機

# BoolProperty|CopyLocal|Description
source: Indicates whether the reference will be copied to the output directory.
cs: Určuje, jestli se odkaz zkopíruje do výstupního adresáře.
de: Gibt an, ob der Verweis in das Ausgabeverzeichnis kopiert wird.
es: Indica si la referencia se copiará en el directorio de salida.
pl: Wskazuje, czy odwołanie będzie kopiowane do katalogu wyjściowego.
ru: Указывает, будет ли ссылочная сборка скопирована в выходной каталог.
zh_hans: 指示是否将引用复制到输出目录。
zh_hant: 表示是否將參考複製到輸出目錄。

# StringProperty|Culture|DisplayName
source: Culture
cs: Jazyková verze
de: Kultur
es: Referencia cultural
pl: Kultura
ru: Культура
zh_hans: 区域性
zh_hant: 文化特性

# StringProperty|Culture|Description
source: The value of the culture field from the assembly metadata.
cs: Hodnota pole Jazyková verze z metadat sestavení
de: Der Wert des Felds "Kultur" aus den Assemblymetadaten.
es: Valor del campo Referencia cultural de los metadatos de ensamblado.
pl: Wartość pola kultury z metadanych zestawu.
ru: Значение поля культуры из метаданных сборки.
zh_hans: 程序集元数据中“区域性”字段的值。
zh_hant: 來自組件中繼資料 [文化特性] 欄位的值。

# StringProperty|Description|DisplayName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
pl: Opis
ru: Описание
zh_hans: 说明
zh_hant: 說明

# StringProperty|Description|Description
source: The value of the Title field from the assembly metadata.
cs: Hodnota pole Název z metadat sestavení
de: Der Wert des Felds "Title" aus den Assemblymetadaten.
es: Valor del campo Título de los metadatos de ensamblado.
pl: Wartość pola Tytuł z metadanych zestawu.
ru: Значение поля заголовка из метаданных сборки.
zh_hans: 程序集元数据中“标题”字段的值。
zh_hant: 來自組件中繼資料的 [標題] 欄位的值。

# BoolProperty|EmbedInteropTypes|DisplayName
source: Embed Interop Types
cs: Vložit typy spolupráce
de: Interoptypen einbetten
es: Incrustar tipos de interoperabilidad
pl: Osadź typy międzyoperacyjne
ru: Внедрить типы взаимодействия
zh_hans: 嵌入互操作类型
zh_hant: 內嵌 Interop 類型

# BoolProperty|EmbedInteropTypes|Description
source: Indicates whether types defined in this assembly will be embedded into the target assembly.
cs: Určuje, zda typy definované v tomto sestavení budou vloženy do cílového sestavení.
de: Gibt an, ob in der Assembly definierte Typen in die Zielassembly eingebettet werden.
es: Indica si los tipos definidos en este ensamblado se incrustarán en el ensamblado de destino.
pl: Wskazuje, czy typy zdefiniowane w tym zestawie będą osadzone w zestawie docelowym.
ru: Указывает, будут ли типы, определенные в этой сборке, внедрены в целевую сборку.
zh_hans: 指示是否将此程序集中定义的类型嵌入目标程序集。
zh_hant: 指出此組件中所定義的類型是否將內嵌在目標組件中。

# EnumProperty|FileType|DisplayName
source: File Type
cs: Typ souboru
de: Dateityp
es: Tipo de archivo
pl: Typ pliku
ru: Тип файла
zh_hans: 文件类型
zh_hant: 檔案類型

# EnumProperty|FileType|Description
source: The file type of the reference.
cs: Typ souboru odkazu
de: Der Dateityp des Verweises.
es: Tipo de archivo de la referencia.
pl: Typ pliku odwołania.
ru: Тип файла ссылки.
zh_hans: 引用的文件类型。
zh_hant: 參考的檔案類型。

# EnumValue|FileType.Assembly|DisplayName
source: .NET assembly
cs: Sestavení .NET
es: Ensamblado .NET
pl: Zestaw .NET
ru: Сборка .NET
zh_hans: .NET 程序集
zh_hant: .NET 組件

# EnumValue|FileType.ActiveX|DisplayName
source: COM type library
cs: Knihovna typů COM
de: COM-Typbibliothek
es: Biblioteca de tipos COM
pl: Biblioteka typów COM
ru: Библиотека типов COM
zh_hans: COM 类型库
zh_hant: COM 類型程式庫

# EnumValue|FileType.Native Assembly|DisplayName
source: Native Assembly
cs: Nativní sestavení
es: Ensamblado nativo
pl: Zestaw natywny
ru: Машинная сборка
zh_hans: 本机程序集
zh_hant: 原生組譯碼

# StringProperty|Identity|DisplayName
source: Identity
cs: Identita
de: Identität
es: Identidad
pl: Tożsamość
ru: Идентификатор
zh_hans: 标识
zh_hant: 識別

# StringProperty|Identity|Description
source: Security identity of the referenced assembly (see System.Reflection.Assembly.Evidence or System.Security.Policy.Evidence).
cs: Identita zabezpečení odkazovaného sestavení (viz System.Reflection.Assembly.Evidence nebo System.Security.Policy.Evidence)
de: Sicherheits-ID der referenzierten Assembly (siehe System.Reflection.Assembly.Evidence oder System.Security.Policy.Evidence).
es: Identidad de seguridad del ensamblado al que se hace referencia (vea System.Reflection.Assembly.Evidence o System.Security.Policy.Evidence).
pl: Tożsamość zabezpieczeń zestawu, do którego się odwoływano (zobacz System.Reflection.Assembly.Evidence lub System.Security.Policy.Evidence).
ru: Идентификатор безопасности сборки, на которую указывает ссылка (см System.Reflection.Assembly.Evidence или System.Security.Policy.Evidence).
zh_hans: 所引用程序集的安全标识(参见 System.Reflection.Assembly.Evidence 或 System.Security.Policy.Evidence)。
zh_hant: 參考組件的安全性識別 (請參閱 System.Reflection.Assembly.Evidence 或 System.Security.Policy.Evidence)。

# StringProperty|ResolvedPath|DisplayName
source: Path
cs: Cesta
de: Pfad
es: Ruta de acceso
pl: Ścieżka
ru: Путь
zh_hans: 路径
zh_hant: 路徑

# StringProperty|ResolvedPath|Description
source: Location of the file being referenced.
cs: Umístění odkazovaného souboru
de: Speicherort der Datei, auf die verwiesen wird.
es: Ubicación del archivo al que se hace referencia.
pl: Lokalizacja pliku, którego dotyczy odwołanie.
ru: Расположение файла, на который указывает ссылка.
zh_hans: 所引用的文件的位置。
zh_hant: 正被參考之檔案的位置。

# StringProperty|RuntimeVersion|DisplayName
source: Runtime Version
cs: Verze modulu runtime
de: Laufzeitversion
es: Versión de runtime
pl: Wersja wykonawcza
ru: Версия среды выполнения
zh_hans: 运行时版本
zh_hant: 執行階段版本

# StringProperty|RuntimeVersion|Description
source: Version of the .NET runtime this assembly was compiled against.
cs: Verze modulu runtime .NET, pro kterou bylo toto sestavení zkompilováno
de: Die Version der .NET-Laufzeit, mit der diese Assembly kompiliert wurde.
es: Versión del runtime de .NET con la que se compiló este ensamblado.
pl: Wersja środowiska uruchomieniowego .NET, za pomocą którego został skompilowany ten zestaw.
ru: Версия среды выполнения .NET, для которой была скомпилирована эта сборка.
zh_hans: 编译该程序集所使用的 .NET 运行时的版本。
zh_hant: 編譯此組件時所使用的 .NET 執行階段版本。

# BoolProperty|SpecificVersion|DisplayName
source: Specific Version
cs: Specifická verze
de: Spezifische Version
es: Versión específica
pl: Określona wersja
ru: Конкретная версия
zh_hans: 特定版本
zh_hant: 特定版本

# BoolProperty|SpecificVersion|Description
source: Indicates whether this assembly can be resolved without regard to multi-targeting rules for assembly resolution.
cs: Určuje, zda toto sestavení může být vyřešeno bez ohledu na pravidla cílení na více verzí pro vyřešení sestavení.
de: Gibt an, ob diese Assembly ohne Rücksicht auf die Regeln zur Festlegung von Zielversionen für die Assemblyauflösung aufgelöst werden kann.
es: Indica si este ensamblado se puede resolver independientemente de las reglas de compatibilidad con múltiples versiones (multi-targeting) para la resolución de ensamblados.
pl: Wskazuje, czy ten zestaw może zostać rozpoznany bez uwzględnienia reguł wielowersyjności kodu dla rozpoznawania zestawu.
ru: Определяет, может ли эта сборка быть разрешена без применения правил настройки разрешения сборки для различных версий.
zh_hans: 指示是否可以解析此程序集，无论程序集解析的多定向规则是什么。
zh_hant: 指出這個組件是否可以解析 (不考慮組件解析的多目標規則)。

# BoolProperty|StrongName|DisplayName
source: Strong Name
cs: Silný název
de: Starker Name
es: Nombre seguro
pl: Silna nazwa
ru: Строгое имя
zh_hans: 强名称
zh_hant: 強式名稱

# BoolProperty|StrongName|Description
source: True indicates that the reference has been signed with a key-pair.
cs: Hodnota True určuje, že odkaz byl podepsán pomocí páru klíčů.
de: "True" gibt an, dass der Verweis mit einem Schlüsselpaar signiert wurde.
es: True indica que la referencia se ha firmado con un par de claves.
pl: Wartość true wskazuje, że odwołanie zostało podpisane parą kluczy.
ru: Значение true указывает, что ссылочная сборка была подписана с помощью пары ключей.
zh_hans: True 表示已用密钥对对该引用进行了签名。
zh_hant: True 表示已經使用金鑰組簽署此參考。

# StringProperty|Version|DisplayName
source: Version
cs: Verze
es: Versión
pl: Wersja
ru: Версия
zh_hans: 版本
zh_hant: 版本

# StringProperty|Version|Description
source: Version of reference.
cs: Verze odkazu
de: Verweisversion
es: Versión de referencia.
pl: Wersja odwołania.
ru: Версия ссылочной сборки.
zh_hans: 引用的版本。
zh_hant: 參考的版本。

# StringProperty|RequiredTargetFramework|DisplayName
source: Required Target Framework
cs: Požadované cílové rozhraní
de: Erforderliches Zielframework
es: Plataforma de destino requerida
pl: Wymagana platforma docelowa
ru: Требуемая версия .NET Framework
zh_hans: 需要目标框架
zh_hant: 需要的目標 Framework

# BoolProperty|IsWinMDFile|Description
source: Indicates whether the project system ascertained that this is a WinMD (as opposed to an assembly)
cs: Určuje, zda projektový systém zjistil, že se jedná o soubor WinMD (na rozdíl od sestavení).
de: Gibt an, ob vom Projektsystem überprüft wurde, dass es sich hierbei um eine WinMD handelt (im Gegensatz zu einer Assembly)
es: Indica si el sistema del proyecto garantiza que se trata de un WinMD (en contraposición a un ensamblado)
pl: Wskazuje, czy system projektu upewnił się że jest to WinMD (w przeciwieństwie do zestawu)
ru: Указывает, действительно ли система проекта подтвердила, что файл является WinMD-файлом (а не сборкой)
zh_hans: 指示项目系统是否已确定此为 WinMD (而非程序集)
zh_hant: 表示專案系統是否確認這是 WinMD (而非組件)

# StringProperty|Project|Description
source: the Guid the solution tracks an individual project reference target with
cs: Identifikátor GUID, pomocí něhož řešení sleduje jednotlivý cíl odkazu na projekt
de: Die GUID, mit der die Lösung ein individuelles Projektverweisziel nachverfolgt
es: GUID que la solución usa para realizar un seguimiento de un destino de referencia de un proyecto individual.
pl: identyfikator Guid rozwiązania śledzi docelowe odwołanie pojedynczego projektu za pomocą
ru: идентификатор GUID, с помощью которого решение отслеживает ссылочную целевую сборку отдельного проекта
zh_hans: 解决方案跟踪单个项目引用目标时使用的 GUID
zh_hant: 方案藉以追蹤個別專案參考目標的 GUID

# BoolProperty|WinMDFile|Description
source: Indicates whether the build system ascertained that this is a WinMD (as opposed to an assembly)
cs: Určuje, zda systém sestavení zjistil, že se jedná o soubor WinMD (na rozdíl od sestavení).
de: Gibt an, ob vom Buildsystem überprüft wurde, dass es sich hierbei um eine WinMD handelt (im Gegensatz zu einer Assembly)
es: Indica si el sistema de compilación garantiza que se trata de un WinMD (en contraposición a un ensamblado)
pl: Wskazuje, czy system kompilacji upewnił się że jest to WinMD (w przeciwieństwie do zestawu)
ru: Указывает, действительно ли система сборки подтвердила, что файл является WinMD-файлом (а не сборкой)
zh_hans: 指示生成系统是否已确定此为 WinMD (而非程序集)
zh_hant: 表示建置系統是否確認這是 WinMD (而非組件)

# StringProperty|OriginalItemSpec|Description
source: The evaluated item name of the original reference item whose resolution resulted in this resolved reference item.
cs: Vyhodnocený název původní položky odkazu, jejíž překlad vedl ke vzniku tohoto nerozpoznaného odkazu
de: Der ausgewertete Elementname des ursprünglichen Verweiselements, dessen Auflösung zu diesem aufgelösten Verweiselement geführt hat.
es: Nombre del elemento evaluado del elemento de referencia original cuya resolución produjo este elemento de referencia resuelto.
pl: Sprawdzona nazwa elementu oryginalnego elementu odwołania, którego rozpoznanie spowodowało rozpoznanie tego elementu odwołania.
ru: Вычисленное имя исходного ссылочного элемента, в результате разрешения которого был получен данный разрешенный ссылочный элемент.
zh_hans: 经解析得到此解析的引用项的原始引用项的计算项名称。
zh_hant: 因解析而產生這個已解析參考項目的原始參考項目的評估項目名稱。

# BoolProperty|CopyLocalSatelliteAssemblies|DisplayName
source: Copy Local Satellite Assemblies
de: Lokale Satellitenassemblys kopieren
es: Copiar ensamblados satélite locales
ru: Копировать локальные вспомогательные сборки
zh_hans: 复制本地附属程序集

# BoolProperty|CopyLocalSatelliteAssemblies|Description
source: Indicates whether the satellite assemblies of the reference target should be copied into this project's output directory.
de: Gibt an, ob die Satellitenassemblys des Verweisziels in das Ausgabeverzeichnis dieses Projekts kopiert werden sollen.
es: Indica si los ensamblados satélite del destino de referencia se deben copiar en el directorio de salida de este proyecto.
ru: Указывает, должны ли вспомогательные сборки ссылочной целевой сборки копироваться в выходной каталог проекта.
zh_hans: 指示是否应将引用目标的附属程序集复制到此项目的输出目录中。

# StringProperty|ExcludeAssets|DisplayName
source: Exclude Assets
es: Excluir recursos
zh_hans: 排除资产

# StringProperty|ExcludeAssets|Description
source: Assets to exclude from this reference
de: Auszuschließende Ressourcen aus diesem Verweis
es: Recursos de esta referencia que se deben excluir
ru: Ресурсы, исключаемые из этой ссылки
zh_hans: 要从此引用中排除的资产

# StringProperty|IncludeAssets|DisplayName
source: Include Assets
es: Incluir recursos
zh_hans: 包括资产

# StringProperty|IncludeAssets|Description
source: Assets to include from this reference
de: Einzuschließende Ressourcen aus diesem Verweis
es: Recursos de esta referencia que se deben incluir
ru: Ресурсы, включаемые из этой ссылки
zh_hans: 要从此引用中包括的资产

# BoolProperty|ReferenceOutputAssembly|DisplayName
source: Reference Output Assembly
de: Verweisausgabeassembly
es: Ensamblado de salida de referencia
ru: Ссылка на выходную сборку
zh_hans: 引用输出程序集

# BoolProperty|ReferenceOutputAssembly|Description
source: A value indicating whether the compiler should include a reference to the target project's primary output assembly.
de: Ein Wert, der angibt, ob vom Compiler ein Verweis auf die primäre Ausgabeassembly des Zielprojekts eingeschlossen werden soll.
es: Valor que indica si el compilador debe incluir una referencia al ensamblado de salida principal del proyecto de destino.
ru: Значение, указывающее, должен ли компилятор включить ссылку на основную выходную сборку целевого проекта.
zh_hans: 该值指示编译器是否应包括对目标项目主输出程序集的引用。

# StringProperty|PrivateAssets|DisplayName
source: Private Assets
es: Recursos privados
zh_hans: 私有资产

# StringProperty|PrivateAssets|Description
source: Assets that are private in this reference
de: Private Ressourcen in diesem Verweis
es: Recursos que son privados en esta referencia
ru: Ресурсы, являющиеся закрытыми в этой ссылке
zh_hans: 此引用中的私有资产
